{
  "base_model_name_or_path": "Qwen/Qwen2.5-VL-3B-Instruct",
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "r": 64,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "target_modules": [
    "down_proj",
    "gate_proj",
    "q_proj",
    "up_proj",
    "v_proj",
    "o_proj",
    "k_proj"
  ],
  "bias": "none",
  "inference_mode": true,
  "init_lora_weights": true
}